<a href="https://colab.research.google.com/github/SuroshK/AI/blob/master/CW/CW_J022_110720.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# #indentation
# a=5
# b=6

# print(a,b)

# if b>0:
#     print('a')

# def printer():
#   print(a+b)
# def sum(a,b):
#   return a+b

# func_ret1=printer()

# c=func_ret2=sum(a,b)
# print(c)

## to remove variable b from the environment
# del b 
# print(b)

##as here a is not equal to c
# print(a==c)

##binary to integer - (int('number of that base',base)) 

# d=int('111',2)
# print(d)
# float(d)

# d=int('A',11)

# print(type(str(d)))

# a_=4 #for using reserve keyword
# a=6
# _a=9 # variable is intended for internal use
# __a=12
# print(a_,a,_a,__a)

# #public variable vs private variable

# class human:
#   """Members fo a class"""
#   #attribute - variables - compulsory
#   #method/behaviour - function - compulsory


class Student:
  def __init__(self, name):
    self.__name = name
  
  def displayname(self):
    print(self.__name)

#Class vs Object
s1 = Student('Santhosh')
s1.displayname()

#Raise an error
# print(s1.__name)

Santhosh

In [ ]:
# import pandas as pd

# #empty dataframe
# a = pd.DataFrame()

# #dataframe with column only
# list1=['a','e','f']
# a1 = pd.DataFrame(columns=list1)
# print(a1)

# #dataframe with both rows and column
# a2=pd.DataFrame(index=list1,columns=list1)
# print(a2)

a3=pd.read_csv("https://people.sc.fsu.edu/~jburkardt/data/csv/addresses.csv")
a3

                    John       Doe  ...   NJ  08075
0                   Jack  McGinnis  ...   PA   9119
1          John "Da Man"    Repici  ...   NJ   8075
2                Stephen     Tyler  ...   SD  91234
3                    NaN  Blankman  ...   SD    298
4  Joan "the bone", Anne       Jet  ...   CO    123

[5 rows x 6 columns]